bin/src/main/java/com/soapws/bcxml/postMandate.xml

        <!--Mandates Request-->


        <!--<?xml version="1.0" encoding="UTF-8"?>
        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webservice.fiusb.ci.infosys.com">
            <soapenv:Header/>
            <soapenv:Body>
                <web:executeService>
                    <arg_0_0>-->
        <Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
            <Body>
                <executeService xmlns="http://webservice.fiusb.ci.infosys.com">
                    <arg_0_0 xmlns="">
                        <![CDATA[
        <FIXML xsi:schemaLocation="http://www.finacle.com/fixml executeFinacleScript.xsd" xmlns="http://www.finacle.com/fixml" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
          <Header>
            <RequestHeader>
              <MessageKey>
                <RequestUUID>Req_1561731734654</RequestUUID>
                <ServiceRequestId>executeFinacleScript</ServiceRequestId>
                <ServiceRequestVersion>10.2</ServiceRequestVersion>
                <ChannelId>COR</ChannelId>
                <LanguageId></LanguageId>
              </MessageKey>
              <RequestMessageInfo>
                <BankId></BankId>
                <TimeZone></TimeZone>
                <EntityId></EntityId>
                <EntityType></EntityType>
                <ArmCorrelationId></ArmCorrelationId>
                <MessageDateTime>2019-06-28T15:22:14.654</MessageDateTime>
              </RequestMessageInfo>
              <Security>
                <Token>
                  <PasswordToken>
                    <UserId></UserId>
                    <Password></Password>
                  </PasswordToken>
                </Token>
                <FICertToken></FICertToken>
                <RealUserLoginSessionId></RealUserLoginSessionId>
                <RealUser></RealUser>
                <RealUserPwd></RealUserPwd>
                <SSOTransferToken></SSOTransferToken>
              </Security>
            </RequestHeader>
          </Header>
          <Body>
            <executeFinacleScriptRequest>
              <ExecuteFinacleScriptInputVO>
                <requestId>customMandatesUpdate.scr</requestId>
              </ExecuteFinacleScriptInputVO>
              <executeFinacleScript_CustomData>
                <accountID>6213954018</accountID>
                <signId>FCMBFIN7696098</signId>
                <option>F</option>
                <Remarks>SOLE</Remarks>
              </executeFinacleScript_CustomData>
            </executeFinacleScriptRequest>
          </Body>
        </FIXML>
        ]]>
                    </arg_0_0>
                </executeService>
            </Body>
        </Envelope>
                <!--</arg_0_0>
                      </web:executeService>
                  </soapenv:Body>
              </soapenv:Envelope>-->



        <!--<?xml version="1.0" encoding="UTF-8"?>
        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webservice.fiusb.ci.infosys.com">
            <soapenv:Header/>
            <soapenv:Body>
                <web:executeService>
                    <arg_0_0>-->
<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
<Body>
    <executeService xmlns="http://webservice.fiusb.ci.infosys.com">
        <arg_0_0 xmlns="">
            <![CDATA[
        <FIXML xsi:schemaLocation="http://www.finacle.com/fixml executeFinacleScript.xsd" xmlns="http://www.finacle.com/fixml" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
          <Header>
            <RequestHeader>
              <MessageKey>
                <RequestUUID>Req_1561731734391</RequestUUID>
                <ServiceRequestId>executeFinacleScript</ServiceRequestId>
                <ServiceRequestVersion>10.2</ServiceRequestVersion>
                <ChannelId>COR</ChannelId>
                <LanguageId></LanguageId>
              </MessageKey>
              <RequestMessageInfo>
                <BankId></BankId>
                <TimeZone></TimeZone>
                <EntityId></EntityId>
                <EntityType></EntityType>
                <ArmCorrelationId></ArmCorrelationId>
                <MessageDateTime>2019-06-28T15:22:14.391</MessageDateTime>
              </RequestMessageInfo>
              <Security>
                <Token>
                  <PasswordToken>
                    <UserId></UserId>
                    <Password></Password>
                  </PasswordToken>
                </Token>
                <FICertToken></FICertToken>
                <RealUserLoginSessionId></RealUserLoginSessionId>
                <RealUser></RealUser>
                <RealUserPwd></RealUserPwd>
                <SSOTransferToken></SSOTransferToken>
              </Security>
            </RequestHeader>
          </Header>
          <Body>
            <executeFinacleScriptRequest>
              <ExecuteFinacleScriptInputVO>
                <requestId>customMandatesUpdate.scr</requestId>
              </ExecuteFinacleScriptInputVO>
              <executeFinacleScript_CustomData>
                <accountID>6212351012</accountID>
                <signId>FCMBFIN7670989</signId>
                <option>F</option>
                <Remarks>sole</Remarks>
              </executeFinacleScript_CustomData>
            </executeFinacleScriptRequest>
          </Body>
        </FIXML>
        ]]>
        </arg_0_0>
    </executeService>
</Body>
</Envelope>
        <!--</arg_0_0>
              </web:executeService>
          </soapenv:Body>
      </soapenv:Envelope>-->


        <!--Mandates Response-->

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Header/><soapenv:Body><p594:executeServiceResponse xmlns:p594="http://webservice.fiusb.ci.infosys.com"><executeServiceReturn><FIXML xsi:schemaLocation=&quot;http://www.finacle.com/fixml executeFinacleScript.xsd&quot; xmlns=&quot;http://www.finacle.com/fixml&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot;>
    <Header>
        <ResponseHeader>
            <RequestMessageKey>
                <RequestUUID>Req_1561731734654</RequestUUID>
                <ServiceRequestId>executeFinacleScript</ServiceRequestId>
                <ServiceRequestVersion>10.2</ServiceRequestVersion>
                <ChannelId>COR</ChannelId>
            </RequestMessageKey>
            <ResponseMessageInfo>
                <BankId>01</BankId>
                <TimeZone></TimeZone>
                <MessageDateTime>2019-06-28T14:24:15.933</MessageDateTime>
            </ResponseMessageInfo><UBUSTransaction>
            <Id/>
            <Status/>
        </UBUSTransaction>
            <HostTransaction>
                <Id/>
                <Status>SUCCESS</Status>
            </HostTransaction>
            <HostParentTransaction>
                <Id/>
                <Status/>
            </HostParentTransaction>
            <CustomInfo/>
        </ResponseHeader>
    </Header>
    <Body>
        <executeFinacleScriptResponse>
            <ExecuteFinacleScriptOutputVO>
            </ExecuteFinacleScriptOutputVO><executeFinacleScript_CustomData>
            <signId>FCMBFIN7696194</signId><SuccessOrFailure>SUCCESS</SuccessOrFailure></executeFinacleScript_CustomData>
        </executeFinacleScriptResponse></Body></FIXML></executeServiceReturn></p594:executeServiceResponse></soapenv:Body></soapenv:Envelope>


<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Header/><soapenv:Body><p594:executeServiceResponse xmlns:p594="http://webservice.fiusb.ci.infosys.com"><executeServiceReturn><FIXML xsi:schemaLocation=&quot;http://www.finacle.com/fixml executeFinacleScript.xsd&quot; xmlns=&quot;http://www.finacle.com/fixml&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot;>
    <Header>
        <ResponseHeader>
            <RequestMessageKey>
                <RequestUUID>Req_1561731734391</RequestUUID>
                <ServiceRequestId>executeFinacleScript</ServiceRequestId>
                <ServiceRequestVersion>10.2</ServiceRequestVersion>
                <ChannelId>COR</ChannelId>
            </RequestMessageKey>
            <ResponseMessageInfo>
                <BankId>01</BankId>
                <TimeZone></TimeZone>
                <MessageDateTime>2019-06-28T14:24:15.671</MessageDateTime>
            </ResponseMessageInfo><UBUSTransaction>
            <Id/>
            <Status/>
        </UBUSTransaction>
            <HostTransaction>
                <Id/>
                <Status>SUCCESS</Status>
            </HostTransaction>
            <HostParentTransaction>
                <Id/>
                <Status/>
            </HostParentTransaction>
            <CustomInfo/>
        </ResponseHeader>
    </Header>
    <Body>
        <executeFinacleScriptResponse>
            <ExecuteFinacleScriptOutputVO>
            </ExecuteFinacleScriptOutputVO>
            <executeFinacleScript_CustomData>
                <signId>FCMBFIN7696223</signId>
                <SuccessOrFailure>SUCCESS</SuccessOrFailure></executeFinacleScript_CustomData>
        </executeFinacleScriptResponse></Body></FIXML></executeServiceReturn></p594:executeServiceResponse></soapenv:Body></soapenv:Envelope>